7767517
137 151
Input            input0                   0 1 input0
Convolution      261                      1 1 input0 261 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
ReLU             263                      1 1 261 263
ConvolutionDepthWise 264                      1 1 263 264 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             266                      1 1 264 266
Convolution      267                      1 1 266 267 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             269                      1 1 267 269
ConvolutionDepthWise 270                      1 1 269 270 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             272                      1 1 270 272
Convolution      273                      1 1 272 273 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             275                      1 1 273 275
ConvolutionDepthWise 276                      1 1 275 276 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             278                      1 1 276 278
Convolution      279                      1 1 278 279 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             281                      1 1 279 281
ConvolutionDepthWise 282                      1 1 281 282 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             284                      1 1 282 284
Convolution      285                      1 1 284 285 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             287                      1 1 285 287
ConvolutionDepthWise 288                      1 1 287 288 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             290                      1 1 288 290
Convolution      291                      1 1 290 291 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             293                      1 1 291 293
ConvolutionDepthWise 294                      1 1 293 294 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             296                      1 1 294 296
Convolution      297                      1 1 296 297 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             299                      1 1 297 299
Split            splitncnn_0              1 4 299 299_splitncnn_0 299_splitncnn_1 299_splitncnn_2 299_splitncnn_3
Convolution      300                      1 1 299_splitncnn_3 300 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Convolution      302                      1 1 300 302 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608
ReLU             304                      1 1 302 304
Convolution      305                      1 1 304 305 0=32 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=9216
Convolution      307                      1 1 299_splitncnn_2 307 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Convolution      309                      1 1 307 309 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608
ReLU             311                      1 1 309 311
Convolution      312                      1 1 311 312 0=32 1=3 11=3 2=3 12=3 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=9216
Convolution      314                      1 1 299_splitncnn_1 314 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Convolution      316                      1 1 314 316 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456
ReLU             318                      1 1 316 318
Convolution      319                      1 1 318 319 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6912
ReLU             321                      1 1 319 321
Convolution      322                      1 1 321 322 0=32 1=3 11=3 2=5 12=5 3=1 13=1 4=5 14=5 15=5 16=5 5=1 6=9216
Concat           324                      3 1 305 312 322 324 0=0
Convolution      325                      1 1 324 325 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Convolution      327                      1 1 299_splitncnn_0 327 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         329                      2 1 325 327 329 0=0
ReLU             330                      1 1 329 330
Split            splitncnn_1              1 4 330 330_splitncnn_0 330_splitncnn_1 330_splitncnn_2 330_splitncnn_3
ConvolutionDepthWise 331                      1 1 330_splitncnn_3 331 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             333                      1 1 331 333
Convolution      334                      1 1 333 334 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             336                      1 1 334 336
ConvolutionDepthWise 337                      1 1 336 337 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             339                      1 1 337 339
Convolution      340                      1 1 339 340 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             342                      1 1 340 342
ConvolutionDepthWise 343                      1 1 342 343 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             345                      1 1 343 345
Convolution      346                      1 1 345 346 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             348                      1 1 346 348
Split            splitncnn_2              1 4 348 348_splitncnn_0 348_splitncnn_1 348_splitncnn_2 348_splitncnn_3
ConvolutionDepthWise 349                      1 1 348_splitncnn_3 349 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             351                      1 1 349 351
Convolution      352                      1 1 351 352 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ReLU             354                      1 1 352 354
ConvolutionDepthWise 355                      1 1 354 355 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             357                      1 1 355 357
Convolution      358                      1 1 357 358 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             360                      1 1 358 360
Split            splitncnn_3              1 4 360 360_splitncnn_0 360_splitncnn_1 360_splitncnn_2 360_splitncnn_3
Convolution      361                      1 1 360_splitncnn_3 361 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ReLU             362                      1 1 361 362
Convolution      363                      1 1 362 363 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             364                      1 1 363 364
ConvolutionDepthWise 365                      1 1 364 365 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             366                      1 1 365 366
Convolution      367                      1 1 366 367 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             368                      1 1 367 368
Split            splitncnn_4              1 3 368 368_splitncnn_0 368_splitncnn_1 368_splitncnn_2
ConvolutionDepthWise 369                      1 1 330_splitncnn_2 369 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             370                      1 1 369 370
Convolution      371                      1 1 370 371 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Permute          372                      1 1 371 372 0=3
ConvolutionDepthWise 373                      1 1 330_splitncnn_1 373 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             374                      1 1 373 374
Convolution      375                      1 1 374 375 0=9 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
Permute          376                      1 1 375 376 0=3
ConvolutionDepthWise 377                      1 1 330_splitncnn_0 377 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             378                      1 1 377 378
Convolution      379                      1 1 378 379 0=30 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
Permute          380                      1 1 379 380 0=3
ConvolutionDepthWise 381                      1 1 348_splitncnn_2 381 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             382                      1 1 381 382
Convolution      383                      1 1 382 383 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Permute          384                      1 1 383 384 0=3
ConvolutionDepthWise 385                      1 1 348_splitncnn_1 385 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             386                      1 1 385 386
Convolution      387                      1 1 386 387 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Permute          388                      1 1 387 388 0=3
ConvolutionDepthWise 389                      1 1 348_splitncnn_0 389 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             390                      1 1 389 390
Convolution      391                      1 1 390 391 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Permute          392                      1 1 391 392 0=3
ConvolutionDepthWise 393                      1 1 360_splitncnn_2 393 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             394                      1 1 393 394
Convolution      395                      1 1 394 395 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Permute          396                      1 1 395 396 0=3
ConvolutionDepthWise 397                      1 1 360_splitncnn_1 397 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             398                      1 1 397 398
Convolution      399                      1 1 398 399 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Permute          400                      1 1 399 400 0=3
ConvolutionDepthWise 401                      1 1 360_splitncnn_0 401 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             402                      1 1 401 402
Convolution      403                      1 1 402 403 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10240
Permute          404                      1 1 403 404 0=3
Convolution      405                      1 1 368_splitncnn_2 405 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
Permute          406                      1 1 405 406 0=3
Convolution      407                      1 1 368_splitncnn_1 407 0=9 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
Permute          408                      1 1 407 408 0=3
Convolution      409                      1 1 368_splitncnn_0 409 0=30 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=69120
Permute          410                      1 1 409 410 0=3
Reshape          420                      1 1 372 420 0=4 1=-1
Reshape          430                      1 1 384 430 0=4 1=-1
Reshape          440                      1 1 396 440 0=4 1=-1
Reshape          450                      1 1 406 450 0=4 1=-1
Concat           output0                  4 1 420 430 440 450 output0 0=0
Reshape          461                      1 1 376 461 0=3 1=-1
Reshape          471                      1 1 388 471 0=3 1=-1
Reshape          481                      1 1 400 481 0=3 1=-1
Reshape          491                      1 1 408 491 0=3 1=-1
Concat           492                      4 1 461 471 481 491 492 0=0
Reshape          502                      1 1 380 502 0=10 1=-1
Reshape          512                      1 1 392 512 0=10 1=-1
Reshape          522                      1 1 404 522 0=10 1=-1
Reshape          532                      1 1 410 532 0=10 1=-1
Concat           533                      4 1 502 512 522 532 533 0=0
Softmax          534                      1 1 492 534 0=1 1=1
